---
kind: property
id: P:Autodesk.Revit.DB.ElementNode.LinkInstanceId
source: html/c3b0fdbf-8fd9-0e84-0b29-3868a55c1d81.htm
---
# Autodesk.Revit.DB.ElementNode.LinkInstanceId Property

The Id of the link instance for the element.

## Syntax (C#)
```csharp
public ElementId LinkInstanceId { get; }
```